[
    {
        "title": "MTR Corporation Proposes 9.4% Fare Increase for Airport Express",
        "tldr": [
            "MTR Corporation proposes a 9.4% fare hike for the Airport Express line.",
            "Adult fares between Hong Kong Station and the airport may rise from HK$110 to HK$120.",
            "The fare increase is planned for June, pending legislative approval.",
            "This would be the first Airport Express fare increase in eight years."
        ],
        "summary": "The MTR Corporation has proposed a 9.4 percent fare increase for its Airport Express service, which would take effect in June if approved by the legislature. Under the proposal, an adult Octopus card fare from Hong Kong Station to the airport would rise from HK$110 to HK$120, while regular single-journey ticket prices could go up to HK$130. The fare hike, which would be the first in eight years, is attributed to sustained financial challenges since the COVID-19 pandemic, with passenger numbers still only at 70 percent of pre-pandemic levels. MTR also noted that fare increases for airport rail services in other major cities have ranged from 13 to 38 percent over the past eight years.",
        "refs": [
          {
            "sentence": "The MTR Corporation has proposed a 9.4 percent fare increase for its Airport Express service, which would take effect in June if approved by the legislature.",
            "id": "10"
          },
          {
            "sentence": "Under the proposal, an adult Octopus card fare from Hong Kong Station to the airport would rise from HK$110 to HK$120, while regular single-journey ticket prices could go up to HK$130.",
            "id": "10"
          },
          {
            "sentence": "The fare hike, which would be the first in eight years, is attributed to sustained financial challenges since the COVID-19 pandemic, with passenger numbers still only at 70 percent of pre-pandemic levels.",
            "id": "191"
          },
          {
            "sentence": "MTR also noted that fare increases for airport rail services in other major cities have ranged from 13 to 38 percent over the past eight years.",
            "id": "191"
          }
        ],
        "news_articles_ids": [10, 191]
    },
    {
        "title": "China Expresses Condolences and Highlights Vatican Ties After Pope Francis's Death",
        "tldr": [
            "China's Foreign Ministry expressed condolences following the death of Pope Francis.",
            "Officials highlighted recent constructive contact and friendly exchanges with the Vatican.",
            "China and the Vatican signed a historic 2018 agreement on the appointment of bishops, extended again last year.",
            "Pope Francis had expressed hope for stronger relations with China, calling it a 'promise and a hope' for the Church."
        ],
        "summary": "Following the death of Pope Francis, China’s Foreign Ministry extended its condolences and praised the recent positive developments in China-Vatican relations. Ministry spokesman Guo Jiakun noted that both sides have maintained constructive contact and friendly exchanges in recent years. The Vatican and Beijing had signed a landmark agreement in 2018 on the appointment of bishops, which was renewed last year, aimed at bridging the longstanding schism in China's Catholic community. Pope Francis had shown interest in improving ties with China, calling the country a 'great nation' and expressing hope for a future visit.",
        "refs": [
          {
            "sentence": "Following the death of Pope Francis, China’s Foreign Ministry extended its condolences and praised the recent positive developments in China-Vatican relations.",
            "id": "11"
          },
          {
            "sentence": "Ministry spokesman Guo Jiakun noted that both sides have maintained constructive contact and friendly exchanges in recent years.",
            "id": "185"
          },
          {
            "sentence": "The Vatican and Beijing had signed a landmark agreement in 2018 on the appointment of bishops, which was renewed last year, aimed at bridging the longstanding schism in China's Catholic community.",
            "id": "185"
          },
          {
            "sentence": "Pope Francis had shown interest in improving ties with China, calling the country a 'great nation' and expressing hope for a future visit.",
            "id": "185"
          }
        ],
        "news_articles_ids": [11, 185]
    },
    {
        "title": "US Proposes Massive Tariffs on Southeast Asian Solar Panels Over Chinese Trade Practices",
        "tldr": [
            "The US plans to impose tariffs up to 3,521% on solar panels from Southeast Asia.",
            "The move targets alleged Chinese subsidies and dumping practices.",
            "Companies from Cambodia, Thailand, Malaysia, and Vietnam are affected.",
            "Tariffs still require ratification by the International Trade Commission in June."
        ],
        "summary": "The United States has announced plans to impose tariffs as high as 3,521 percent on solar panel imports from Southeast Asian countries, targeting what it describes as unfair Chinese trade practices. The proposed duties follow year-long anti-dumping and countervailing duty investigations initiated by U.S. and other solar manufacturers. The tariffs would impact firms operating in Cambodia, Thailand, Malaysia, and Vietnam, including Chinese companies like Jinko Solar and Trina Solar. These tariffs, which still require approval from the International Trade Commission in June, come amid broader tensions over trade and protectionism. China has criticized the move, calling it protectionist and counterproductive.",
        "refs": [
            {
                "sentence": "The United States has announced plans to impose tariffs as high as 3,521 percent on solar panel imports from Southeast Asian countries, targeting what it describes as unfair Chinese trade practices.",
                "id": "12"
            },
            {
                "sentence": "The proposed duties follow year-long anti-dumping and countervailing duty investigations initiated by U.S. and other solar manufacturers.",
                "id": "12"
            },
            {
                "sentence": "The tariffs would impact firms operating in Cambodia, Thailand, Malaysia, and Vietnam, including Chinese companies like Jinko Solar and Trina Solar.",
                "id": "189"
            },
            {
                "sentence": "These tariffs, which still require approval from the International Trade Commission in June, come amid broader tensions over trade and protectionism.",
                "id": "12"
            },
            {
                "sentence": "China has criticized the move, calling it protectionist and counterproductive.",
                "id": "189"
            }
        ],
        "news_articles_ids": [12, 189]
    },
    {
        "title": "Leung Chai-yan, Daughter of Former Hong Kong Leader CY Leung, Dies at 33",
        "tldr": [
            "Leung Chai-yan, daughter of ex-Hong Kong chief executive CY Leung, has died at age 33.",
            "She passed away suddenly but peacefully in bed, according to her father.",
            "Police ruled out suicide or suspicious circumstances following forensic investigations.",
            "She was found unresponsive in a Shau Kei Wan serviced apartment on Tuesday evening."
        ],
        "summary": "Leung Chai-yan, the 33-year-old daughter of former Hong Kong chief executive CY Leung, has passed away. Her father confirmed her death via social media, stating that she died very suddenly and peacefully in bed. Police and forensic investigators have ruled out suicide and other suspicious causes. According to authorities, she was found unresponsive at a serviced apartment in Shau Kei Wan on Tuesday evening and was pronounced dead at the scene.",
        "refs": [
            {
            "sentence": "Leung Chai-yan, the 33-year-old daughter of former Hong Kong chief executive CY Leung, has passed away.",
            "id": "68"
            },
            {
            "sentence": "Her father confirmed her death via social media, stating that she died very suddenly and peacefully in bed.",
            "id": "397"
            },
            {
            "sentence": "Police and forensic investigators have ruled out suicide and other suspicious causes.",
            "id": "68"
            },
            {
            "sentence": "According to authorities, she was found unresponsive at a serviced apartment in Shau Kei Wan on Tuesday evening and was pronounced dead at the scene.",
            "id": "397"
            }
        ],
        "news_articles_ids": [68, 397]
    },
    {
        "title": "Hong Kong Man Jailed for One Year Under Article 23 for Seditious Social Media Posts",
        "tldr": [
            "Chow Kim-ho, 57, was sentenced to one year in jail for publishing seditious content online.",
            "He pleaded guilty under Hong Kong's Safeguarding National Security Ordinance, also known as Article 23.",
            "Chow admitted to posting 145 seditious comments on Facebook, Instagram, and Threads in 2023.",
            "Authorities said his posts incited hatred toward the Chinese Communist Party and Hong Kong government."
        ],
        "summary": "Chow Kim-ho, a 57-year-old former member of the League of Social Democrats, has been sentenced to one year in prison for posting 145 seditious messages on social media platforms, including Facebook, Instagram, and Threads. He pleaded guilty to one count of knowingly publishing seditious publications under the Safeguarding National Security Ordinance, commonly referred to as Article 23. The court found that his posts, made between March and November 2023, incited hatred toward the Chinese Communist Party and Hong Kong authorities. During sentencing, the magistrate emphasized that Chow's repeated sharing of such content helped 'set a tone' that promoted government overthrow.",
        "refs": [
            {
                "sentence": "Chow Kim-ho, a 57-year-old former member of the League of Social Democrats, has been sentenced to one year in prison for posting 145 seditious messages on social media platforms, including Facebook, Instagram, and Threads.",
                "id": "69"
            },
            {
                "sentence": "He pleaded guilty to one count of knowingly publishing seditious publications under the Safeguarding National Security Ordinance, commonly referred to as Article 23.",
                "id": "1007"
            },
            {
                "sentence": "The court found that his posts, made between March and November 2023, incited hatred toward the Chinese Communist Party and Hong Kong authorities.",
                "id": "1007"
            },
            {
                "sentence": "During sentencing, the magistrate emphasized that Chow's repeated sharing of such content helped 'set a tone' that promoted government overthrow.",
                "id": "1007"
            }
        ],
        "news_articles_ids": [69, 1007]
    }
]
